# PAIR PROGRAMING - MODULO 3- LECCION 02


1. ¿Qué diferencia hay entre una Serie y un DataFrame?

Una serie es una estructura de datos unidimensional que puede contener cualquier tipo de datos.
Un DataFrame es una estrutura de datos bidimensional que consta de filas y columnas, similar a una hoja de cálculo o una tabla de base de datos.

2. Momento de trabajar con Series. Contesta a las siguientes preguntas:

In [3]:
import pandas as pd
import numpy as np

2.1 Crea dos listas:

    - Una que se llame "valores" que tenga 7 números aleatorios.

    - Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [4]:
valores = np.random.randint(1,100,(7))
valores

array([29, 92, 26, 56,  7, 94, 67])

In [5]:
indices = ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]
indices

['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado', 'domingo']

2.2 A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [6]:
serie = pd.Series(valores, index = indices)
serie

lunes        29
martes       92
miercoles    26
jueves       56
viernes       7
sabado       94
domingo      67
dtype: int64

2.3 A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

In [7]:
diccionario = {}
for indice, valor in zip(indices, valores):
    diccionario[indice] = valor

In [8]:
diccionario

{'lunes': 29,
 'martes': 92,
 'miercoles': 26,
 'jueves': 56,
 'viernes': 7,
 'sabado': 94,
 'domingo': 67}

2.4 Crea una Serie con el diccionario creado en el punto anterior.

In [9]:
serie_dic = pd.Series(diccionario)
serie_dic

lunes        29
martes       92
miercoles    26
jueves       56
viernes       7
sabado       94
domingo      67
dtype: int64

2.5 ¿Qué forma tiene esta última Serie?

In [10]:
print("Forma de la Serie:", serie_dic.shape)

Forma de la Serie: (7,)

2.6 ¿Qué tipo de datos tiene?

In [11]:
print("Tipo de datos:", serie_dic.dtype)

Tipo de datos: int64

2.7 ¿Qué tamaño tiene?

In [12]:
print("El tamaño de la Serie:", serie_dic.size)

El tamaño de la Serie: 7

2.8 ¿Cuáles son los índices de la Serie?

In [13]:
print("Los índices son:", serie_dic.index)

Los índices son: Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

2.9 ¿Y los values?

In [14]:
print("Los valores son:", serie_dic.values)

Los valores son: [29 92 26 56  7 94 67]

2.10 Extrae el valor para el índice "lunes"

In [15]:
serie_dic["lunes"]

29

2.11 Extrae el valor para el índice "lunes", "martes" y "miércoles".

In [16]:
serie_dic[["lunes", "martes", "miercoles"]]

lunes        29
martes       92
miercoles    26
dtype: int64

2.12 Extrae el valor para el índice "lunes" y "domingo".

In [17]:
serie_dic[["lunes", "domingo"]]

lunes      29
domingo    67
dtype: int64

3. Es el turno de los DataFrames:

3.1 Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [18]:
array = np.random.randint(1,100,(4,3))
array

array([[88, 75,  8],
       [ 1, 51, 30],
       [75, 55, 10],
       [41, 64, 76]])

3.2 Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [19]:
df_paises = pd.DataFrame(array,columns=["España", "Francia", "Italia"])
df_paises

   España  Francia  Italia
0      88       75       8
1       1       51      30
2      75       55      10
3      41       64      76

3.3 Descarga el archivo "medallas" y carga el DataFrame.

In [20]:
df_medallas = pd.read_csv("data/medallas.csv")
df_medallas

   Unnamed: 0             País   Oro  Plata  Bronce
0           1            China  1473    994     720
1           2            Japón  1032   1037     985
2           3    Corea del Sur   745    663     827
3           4             Irán   179    181     197
4           5       Kazajistán   155    158     224
5           6            India   154    202     315
6           7        Tailandia   132    175     278
7           8        Indonesia   112    131     240
8           9     China Taipéi    99    144     276
9          10  Corea del Norte    91    120     235

3.4 Usando el loc extrae todas las columnas de la fila de Tailandia.

In [21]:
df_medallas.loc[df_medallas['País'] == 'Tailandia']

   Unnamed: 0       País  Oro  Plata  Bronce
6           7  Tailandia  132    175     278

In [22]:
df_medallas.loc[df_medallas['País'] == 'Tailandia',:]

   Unnamed: 0       País  Oro  Plata  Bronce
6           7  Tailandia  132    175     278


3.5 Usando el loc extrae todas las columnas de China e Irán.

In [23]:
df_medallas["País"].values

array(['China', 'Japón', 'Corea del Sur', 'Irán', 'Kazajistán', 'India',
       'Tailandia', 'Indonesia', 'China Taipéi', 'Corea del Norte'],
      dtype=object)

In [24]:
(df_medallas['País'] == 'Irán') | (df_medallas['País'] == 'China')

0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: País, dtype: bool

In [25]:
df_medallas.loc[(df_medallas['País'] == 'Irán')| (df_medallas['País'] == 'China'),:]

   Unnamed: 0   País   Oro  Plata  Bronce
0           1  China  1473    994     720
3           4   Irán   179    181     197

3.6 Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [26]:
df_medallas.loc[(df_medallas['País'] == 'Irán')| (df_medallas['País'] == 'China'),["Oro", "Plata", "Bronce"]]

    Oro  Plata  Bronce
0  1473    994     720
3   179    181     197

3.7 Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [27]:
df_medallas.iloc[df_medallas.index[df_medallas["País"] == "India"],:]

   Unnamed: 0   País  Oro  Plata  Bronce
5           6  India  154    202     315


3.8 Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [28]:
df_medallas.iloc[1::2,:]

   Unnamed: 0             País   Oro  Plata  Bronce
1           2            Japón  1032   1037     985
3           4             Irán   179    181     197
5           6            India   154    202     315
7           8        Indonesia   112    131     240
9          10  Corea del Norte    91    120     235

3.9 Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [29]:
#sacar los indices de las columnas con la etiqueta
df_medallas.columns.get_loc('Oro')

2

In [30]:
#ver todos los indices de las columnas
pd.Series(df_medallas.columns)

0    Unnamed: 0
1          País
2           Oro
3         Plata
4        Bronce
dtype: object

In [31]:
df_medallas.iloc[1::2,[df_medallas.columns.get_loc('Oro'),df_medallas.columns.get_loc('Plata'),df_medallas.columns.get_loc('Bronce')]]

    Oro  Plata  Bronce
1  1032   1037     985
3   179    181     197
5   154    202     315
7   112    131     240
9    91    120     235

3.10 Contesta a las siguientes preguntas:

3.11 ¿Qué país consiguió más de 200 medallas de oro?

In [45]:
df_medallas.loc[df_medallas['Oro'] > 200, ["País"]]

            País
0          China
1          Japón
2  Corea del Sur

3.12 ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [46]:
df_medallas.loc[(df_medallas['Oro'] > 200) & (df_medallas['Plata'] > 1000), ["País"]]

    País
1  Japón

3.13 ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [47]:
df_medallas.loc[(df_medallas['Oro'] > 200) & (df_medallas['Bronce'] > 700), ["País"]]

            País
0          China
1          Japón
2  Corea del Sur

3.14 Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [48]:
df_medallas["total"] = df_medallas['Oro'] + df_medallas['Plata'] + df_medallas['Bronce']

In [49]:
df_medallas

   Unnamed: 0             País   Oro  Plata  Bronce  total
0           1            China  1473    994     720   3187
1           2            Japón  1032   1037     985   3054
2           3    Corea del Sur   745    663     827   2235
3           4             Irán   179    181     197    557
4           5       Kazajistán   155    158     224    537
5           6            India   154    202     315    671
6           7        Tailandia   132    175     278    585
7           8        Indonesia   112    131     240    483
8           9     China Taipéi    99    144     276    519
9          10  Corea del Norte    91    120     235    446